<?
function fd_cenz($_result) {
   // ìàòû 
   
/*õóé*/
   $pt[0]="/([à-ÿÀ-ßiI³²ºª¿¯]*[à-ïñ-ôö-ÿÀ-ÏÑ-ÔÖ-ßiI³²ºª¿¯][à-ÿÀ-ßiI³²ºª¿¯][õÕxX]+[yYóÓ]+[eEåÅÿßÈèéÉ]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
   $pt[1]="/([à-ÿÀ-ßiI³²ºª¿¯]*[ðÐÕõ][á-òô-ÿÁ-ÒÔ-ßiI³²ºª¿¯][õÕxX]+[yYóÓ]+[eEåÅÿßÈèéÉ]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
   $pt[2]="/(\b[à-ÿÀ-ßiI³²ºª¿¯][õÕxX]+[yYóÓ]+[eEåÅÿßÈèéÉ]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
   $pt[3]="/(\b[õÕxX]+[yYóÓ]+[eEåÅÿßÈèéÉ]+[à-ÿÀ-ßiI³²ºª¿¯]*)/"; 
/*îòñîñ*/   
   $pt[4]="/(\b[OoÎî0]+[Òò]+[CcÑñ]+[OoÎî0]+[CcÑñ]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
/*åáàë*/   
   $pt[5]="/([à-ÿÀ-ßiI³²ºª¿¯]*[à-êì-ÿÀ-ÊÌ-ßiI³²ºª¿¯][¯¿¨¸Åå]+[Áá6]+[AaÀàOoÎî0]+[ÍíÍlL]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
   $pt[6]="/([à-ÿÀ-ßiI³²ºª¿¯]*[à-êì-ÿÀ-ÃÅ-ÊÌ-ßiI³²ºª¿¯][¯¿¨¸Åå]+[Áá6]+[AaÀà]+[Ëë]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
   $pt[7]="/(\b[¯¿¨¸Åå]+[Áá6]+[AaÀà]+[Ëë]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
/*åáèñü*/   
   $pt[8]="/([à-ÿÀ-ßiI³²ºª¿¯]*[¨¸Åå]+[Áá6]+[Èè]+[CcÑñ]+[Üü]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";     
/*êàöàï*/   
   $pt[9]="/([à-ÿÀ-ßiI³²ºª¿¯]*[KkÊê]+[AaÀàOoÎî]+[Öö]+[AaÀà]+[Ïïn]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
/*õîõîë*/   
   $pt[10]="/([à-ÿÀ-ßiI³²ºª¿¯]*[õÕxX]+[aAàÀOoÎî0]+[õÕxX]+[OoÎî0]*[ËëlL]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
   $pt[30]="/(\b[õÕxXhH]+[kKêÊ]+[àÀaAîÎoO0]+[-.]+[à-ÿÀ-ßa-zA-Z0-9¿¯³²ºª]*)/";
   $pt[31]="/(\b[kKêÊ]+[àÀaAîÎoO0]+[kKêÊ]+[-]+[ëËlL]+[à-ÿÀ-ßa-zA-Z0-9¿¯³²ºª]*)/";
   
/*ìàéäàíóò*/
   $pt[11]="/([à-ÿÀ-ßiI³²ºª¿¯]*[MÌì]+[AaÀà]+[ÈèéÉ]+[ÄädD]+[AaÀà]+[HÍí]+[ÿßyYóÓ]+[Òò]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
/*ïèçä*/   
   $pt[12]="/([à-ÿÀ-ßiI³²ºª¿¯]*[Ïï]+[Ii²³ÈèéÉ]+[ÇçzZ]+[ÄädD]+[a-zA-Zà-ÿÀ-ßiI³²ºª¿¯]*)/";
/*çàëóï*/   
   $pt[13]="/([à-ÿÀ-ßiI³²ºª¿¯]*[Çç]+[AaÀà]+[ËëlL]+[ÓóYy]+[Ïï]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
/*óåáîê*/   
   $pt[14]="/(\b[óÓyYuU]?[¨¸ÅåEe]+[Áá6]+[OoÎî0]?[KkÊêÒòT]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
//   $pt[14]="/(\b[à-öø-ÿÀ-ÖØ-ßiI³²ºª¿¯]*[à-êì-î-öø-ÿÀ-ÊÌ-Î-ÖØ-ßiI³²ºª¿¯][¨¸Åå]+[Áá6]+[OoÎî0]+[KkÊêÒòT]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
//   $pt[14]="/(\b[à-öø-ÿÀ-ÖØ-ßiI³²ºª¿¯]*[¨¸Åå]+[Áá6]+[OoÎî0]+[KkÊêÒòT]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
/*åáèù*/   
   $pt[15]="/(\b[à-öø-ÿÀ-ÖØ-ßiI³²ºª¿¯]*[¨¸Åå]+[Áá6]+[èÈ]+[øØùÙ]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
/*ïèäîð*/   
   $pt[16]="/([à-ÿÀ-ßiI³²ºª¿¯]*[Ïï]+[³²ÈèéÉ]+[ÄädD]+[ÅåEeÎîOo0AaÀà]+[PpÐð]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
/*áëÿäü*/   
//   $pt[17]="/([à-ÿÀ-ßiI³²ºª¿¯]*[Áá6]+[Èè]*[ËëlL]+[ßÿ]+[ÄädD]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
   $pt[29]="/(\b[Áá6]+[Èè]*[ËëlL]+[ßÿ]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
   
//   $pt[17]="/([à-ÿÀ-ßiI³²ºª¿¯]*[ÑñCc]+[Ïï]+[ÅåEe]+[PpÐð]+[ÌìM]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
/*êëèòîð*/   
   $pt[18]="/([à-ÿÀ-ßiI³²ºª¿¯]*[KkÊê]+[ËëlL]+[Èè]+[Òò]+[ÎîOo0]+[PpÐð]+[à-ÿÀ-ßiI³²ºª¿¯]*)/";
/*åáóò*/   
   $pt[19]="/([à-ÿÀ-ßiI³²ºª¿¯]*[à-ÿÀ-ßiI³²ºª¿¯][à-ïñ-ÿÀ-ÏÑ-ßiI³²ºª¿¯][¨¸Åå]+[Áá6]+[yYóÓ]+[Òò][^Òò])/";
   $pt[20]="/([à-ÿÀ-ßiI³²ºª¿¯]*[à-âä-ÿÀ-ÂÄ-ßiI³²ºª¿¯][Ðð][¨¸Åå]+[Áá6]+[yYóÓ]+[Òò][^Òò])/";
   $pt[21]="/(\b[à-ÿÀ-ßiI³²ºª¿¯][¨¸Åå]+[Áá6]+[yYóÓ]+[Òò][^Òò])/";
   $pt[22]="/(\b[¨¸Åå]+[Áá6]+[yYóÓ]+[Òò][^Òò])/";
/*æèä*/
   $pt[23]="/(\b[æÆ]+[.,-_ ;:\"'`~!@#$%^&*()]?[1iI³²èÈûÛuU]+[.,-_ ;:\"'`~!@#$%^&*()]?[äÄdDgG] )/";
   $pt[24]="/(\b[æÆ]+[.,-_ ;:\"'`~!@#$%^&*()]?[1iI³²èÈûÛuU]+[.,-_ ;:\"'`~!@#$%^&*()]?[äÄdDgG]+[.,-_ ;:\"'`~!@#$%^&*()]?[à-ÿÀ-ßa-zA-Z0-9¿¯³²ºª] )/";
   $pt[25]="/(\b[æÆ]+[.,-_;:\"'`~!@#$%^&*()]?[1iI³²èÈûÛuU]+[.,-_ ;:\"'`~!@#$%^&*()]?[äÄdDgG]+[.,-_ ;:\"'`~!@#$%^&*()]?[à-èë-ÿÀ-ÈË-ßa-zA-Z0-9¿¯³²ºª][à-ÿÀ-ßa-zA-Z0-9¿¯³²ºª]+)/";
   $pt[26]="/([à-íï-ÿÀ-ÅÇ-ÍÏ-ßa-zA-Z0-9¿¯³²ºª]+[æÆ]+[.,-_;:\"'`~!@#$%^&*()]?[iI³²èÈûÛuU]+[.,-_;:\"'`~!@#$%^&*()]?[äÄdD]+[.,-_ ;:\"'`~!@#$%^&*()]?[à-ÿÀ-ßa-zA-Z0-9¿¯³²ºª]*)/";
   $pt[27]="/(\b[æÆ]+[óÓ]+[äÄdD]+[à-ÿÀ-ßa-zA-Z0-9¿¯³²ºª]*)/";
   $pt[28]="/(\]\|\[+[iI³²èÈûÛ]+[äÄdD]+[à-ÿÀ-ßa-zA-Z0-9¿¯³²ºª]*)/";
   
   
   if (strpos(" ".$_SERVER['PHP_SELF'], "index.php")){
      $rp="<font color=red>***</font>";  
   }    
   else{
      $rp="<font color=red><a title='\\1'>***</a></font>";  
   }
//   $rp="\\1";
   
   $_result=preg_replace($pt, $rp, $_result);
   return $_result;
}
?>